Autodesk.Revit.UI.Selection.ObjectSnapTypes
This enumerated type contains object snap types allowed to be set during PickPoint operations.

Autodesk.Revit.UI.Selection.ObjectSnapTypes.CoordinationModelPoints
Snaps to Coordination Model points.

Autodesk.Revit.UI.Selection.ObjectSnapTypes.Remote
Remote snaps to objects.
Remarks:
Remote snaps are needed when the snap is away from the object.
This setting has no effect on its own and needs to be used in combination with other settings.
In combination with Nearest, snaps are enabled to extensions of objects on the screen.
In combination with Center, snaps are enabled when hovering in the center of circles.

Autodesk.Revit.UI.Selection.ObjectSnapTypes.Points
Snaps to site points.

Autodesk.Revit.UI.Selection.ObjectSnapTypes.Quadrants
Snaps to quadrant points. For arcs, jump snaps are enabled.

Autodesk.Revit.UI.Selection.ObjectSnapTypes.Tangents
Snaps tangent to an arc.

Autodesk.Revit.UI.Selection.ObjectSnapTypes.Perpendicular
Snaps to perpendicular elements or components.

Autodesk.Revit.UI.Selection.ObjectSnapTypes.Centers
Snaps to the center of an arc.

Autodesk.Revit.UI.Selection.ObjectSnapTypes.Intersections
Snaps to intersections.

Autodesk.Revit.UI.Selection.ObjectSnapTypes.WorkPlaneGrid
Snaps to a work plane grid.

Autodesk.Revit.UI.Selection.ObjectSnapTypes.Nearest
Snaps to the nearest element or component.

Autodesk.Revit.UI.Selection.ObjectSnapTypes.Midpoints
Snaps to the midpoint of an element or component.

Autodesk.Revit.UI.Selection.ObjectSnapTypes.Endpoints
Snaps to the endpoint of an element or component.

Autodesk.Revit.UI.Selection.ObjectSnapTypes.None
Snaps to nothing.